import pandas as pd

A = pd.DataFrame({
    'ФИО': ['Харламов Игорь Юрьевич', 'Батрутдинов Тимур Тахирович', 'Воля Павел Алексеевич'],    # задаем начальные данные
    'Адрес': ['Москва','Санкт-Петербург','Минск'],
    'Телефон': ['8 800 555 35 35','+375 33 746 85 82','+375 44 808 26 48'],
    'Дата рождения': ['28.02.1981', '11.02.1978', '14.03.1979'],
})
A.index.name = '№'
while True:
    print(A)
    a = input("\n Здравствуйте! \n Нажмите 1, если вы хотите изменить какие-то данные. Нажмите 2, если вы хотите удалить какие-либо данные \n Нажмите 3, если вы хотите добавить какие-либо данные. Нажмите 4, если вы не хотите ничего менять (выход): ")
    if a == '1':                                                                                   # если вы нажмете 1, то вы сможете изменить данные таблицы
        b = int(input("\nВведите номер строки (индекс) для изменения: "))
        c = input("Какую колонку изменить? ФИО / Адрес / Телефон / Дата рождения (Вводить колонки надо сторого как написано, соблюдая все заглавные буквы и пробелы): ")
        d = input("Введите новое значение: ")
        A.loc[b, c] = d
        print("Данные успешно изменены!")
    elif a == '2':                                                                                 # если вы нажмете 2, то вы сможете удалить данные таблицы
        z = int(input("\nВведите строку, которую вы хотите удалить\n"))
        A = A.drop(z).reset_index(drop=True)
        A.index.name = 'Номер строки по счету'
        print("Строка успешно удалена!")
    elif a == '3':                                                                                 # если вы нажмете 3, то вы сможете добавить данные таблицы
        fio = input("\nВведите ФИО: ")
        adres = input("Введите адрес: ")
        telefon = input("Введите телефон: ")
        data = input("Введите дату рождения: ")
        A.loc[len(A)] = [fio, adres, telefon, data]
        print("Добавление прошло успешно!")
    elif a == '4':                                                                                 # если вы нажмете 4, то вы сможете выйти без изменения данных таблицы
        print("До свидания!")
        break
    else:
        print("Ошибка: Неверный ввод! Выберите цифру от 1 до 4.")                                  # если вы нажали что-то другое, а не цифры: 1, 2, 3, 4, то вам выдаст ошибку
        # если вы захотите проверить программу еще раз, советую очистить терминал, потому что у меня почему-то он подтупливает и не хочет запускать таблицу заново, возможно я где-то не прав
