import numpy as np
N = int(input("Введите желаемое количство N строк: "))
M = int(input("Введите желаемое количество M столбцов: "))
a = np.random.randint(1, 10, (N, M))                                                            # с помощью спец. команды производим генерацию рандомных чисел в диапазоне от 1 до 9 (т к 10 не вкл)
print("Исходная матрица:\n", a)
b = a.T                                                                                         # с помощью спе. команды ".Т" транспонируем матрицу
print("Транспонированная матрица:\n", b)
if N == M:
    opredelitel_a, opredelitel_b = round(np.linalg.det(a), 2), round(np.linalg.det(b), 2)     # спец. команда, которая считает определитель, а 11 строка их сравнивает
    print("Определитель исходной матрицы = ", opredelitel_a, ", определитель транспонированной матрицы = ", opredelitel_b)   # Выводим в консоль имена переменным, в которых хранятся значения определителей и выводим сами значения матриц
    print("Матрицы равны" if opredelitel_a == opredelitel_b else "Матрицы не равны")
else:
    print("Определитель невозможно вычислить, так как матрица не квадратная!")